vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
	timer_interrupt_enable(TIMER1, TIMER_INT_CH0 | TIMER_INT_CH1 | TIMER_INT_CH2);

	NVIC_SetPriority(TIMER1_IRQn, 0);
	NVIC_EnableIRQ(TIMER1_IRQn);

	timer_enable(TIMER1);
}

static void timer2_config() {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	rcu_periph_clock_enable(RCU_TIMER2);
	timer_deinit(TIMER2);

	timer_parameter_struct timer_initpara;

	timer_initpara.prescaler = TIMER_PSC_1MHZ;
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = static_cast<uint32_t>(~0);
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER2, &timer_initpara);

	timer_flag_clear(TIMER2, ~0);
	timer_interrupt_flag_clear(TIMER2, ~0);

	timer_channel_output_mode_config(TIMER2, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);

	NVIC_SetPriority(TIMER2_IRQn, 0);
	NVIC_EnableIRQ(TIMER2_IRQn);

	timer_enable(TIMER2);
#endif
}

static void timer3_config() {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
#if DMX_MAX_PORTS >= 5
	rcu_periph_clock_enable(RCU_TIMER3);
	timer_deinit(TIMER3);

	timer_parameter_struct timer_initpara;

	timer_initpara.prescaler = TIMER_PSC_1MHZ;
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = static_cast<uint32_t>(~0);
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER3, &timer_initpara);

	timer_flag_clear(TIMER3, ~0);
	timer_interrupt_flag_clear(TIMER3, ~0);

	timer_channel_output_mode_config(TIMER3, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER3, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER3, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER3, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);

	NVIC_SetPriority(TIMER3_IRQn, 0);
	NVIC_EnableIRQ(TIMER3_IRQn);

	timer_enable(TIMER3);
#endif
#endif
}

static void timer6_config() {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	rcu_periph_clock_enable(RCU_TIMER6);
	timer_deinit(TIMER6);

	timer_parameter_struct timer_initpara;
	timer_initpara.prescaler = TIMER_PSC_10KHZ;
	timer_initpara.period = 10000;		// 1 second
	timer_init(TIMER6, &timer_initpara);

	timer_flag_clear(TIMER6, ~0);
	timer_interrupt_flag_clear(TIMER6, ~0);

	timer_interrupt_enable(TIMER6, TIMER_INT_UP);

	NVIC_SetPriority(TIMER6_IRQn, 0);
	NVIC_EnableIRQ(TIMER6_IRQn);

	timer_enable(TIMER6);
#endif
}

static void usart_dma_config(void) {
	DMA_PARAMETER_STRUCT dma_init_struct;
	rcu_periph_clock_enable(RCU_DMA0);
	rcu_periph_clock_enable(RCU_DMA1);

#if defined (DMX_USE_USART0)
	dma_deinit(USART0_DMA, USART0_TX_DMA_CH);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
	dma_init_struct.periph_addr = USART0 + 0x04U;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(USART0_DMA, USART0_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(USART0_DMA, USART0_TX_DMA_CH);
	dma_memory_to_memory_disable(USART0_DMA, USART0_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(USART0_DMA, USART0_TX_DMA_CH, USART0_TX_DMA_SUBPERIx);
# endif
#endif
#if defined (DMX_USE_USART1)
	dma_deinit(USART1_DMA, USART1_TX_DMA_CH);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
	dma_init_struct.periph_addr = USART1 + 0x04U;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(USART1_DMA, USART1_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(USART1_DMA, USART1_TX_DMA_CH);
	dma_memory_to_memory_disable(USART1_DMA, USART1_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(USART1_DMA, USART1_TX_DMA_CH, USART1_TX_DMA_SUBPERIx);
# endif
#endif
#if defined (DMX_USE_USART2)
	dma_deinit(USART2_DMA, USART2_TX_DMA_CH);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
	dma_init_struct.periph_addr = USART2 + 0x04U;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(USART2_DMA, USART2_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(USART2_DMA, USART2_TX_DMA_CH);
	dma_memory_to_memory_disable(USART2_DMA, USART2_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(USART2_DMA, USART2_TX_DMA_CH, USART2_TX_DMA_SUBPERIx);
# endif
#endif
#if defined (DMX_USE_UART3)
	dma_deinit(DMA1, DMA_CH4);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
	dma_init_struct.periph_addr = UART3 + 0x04U;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(DMA1, DMA_CH4, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(DMA1, DMA_CH4);
	dma_memory_to_memory_disable(DMA1, DMA_CH4);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(UART3_DMA, UART3_TX_DMA_CH, UART3_TX_DMA_SUBPERIx);
# endif
#endif

#if defined (DMX_USE_UART4)
	dma_deinit(UART4_DMA, UART4_TX_DMA_CH);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
	dma_init_struct.periph_addr = UART4 + 0x04U;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(UART4_DMA, UART4_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(UART4_DMA, UART4_TX_DMA_CH);
	dma_memory_to_memory_disable(UART4_DMA, UART4_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(UART4_DMA, UART4_TX_DMA_CH, UART4_TX_DMA_SUBPERIx);
# endif
#endif

