vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
#if defined (DMX_USE_USART5)
	dma_deinit(USART5_DMA, USART5_TX_DMA_CH);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
	dma_init_struct.periph_addr = USART5 + 0x04U;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(USART5_DMA, USART5_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(USART5_DMA, USART5_TX_DMA_CH);
	dma_memory_to_memory_disable(USART5_DMA, USART5_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(USART5_DMA, USART5_TX_DMA_CH, USART5_TX_DMA_SUBPERIx);
# endif
#endif
#if defined (DMX_USE_UART6)
	dma_deinit(UART6_DMA, UART6_TX_DMA_CH);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
	dma_init_struct.periph_addr = UART6 + 0x04U;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(UART6_DMA, UART6_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(UART6_DMA, UART6_TX_DMA_CH);
	dma_memory_to_memory_disable(UART6_DMA, UART6_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(UART6_DMA, UART6_TX_DMA_CH, UART6_TX_DMA_SUBPERIx);
# endif
#endif
#if defined (DMX_USE_UART7)
	dma_deinit(UART7_DMA, UART7_TX_DMA_CH);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
	dma_init_struct.periph_addr = UART7 + 0x04U;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(UART7_DMA, UART7_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(UART7_DMA, UART7_TX_DMA_CH);
	dma_memory_to_memory_disable(UART7_DMA, UART7_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(UART7_DMA, UART7_TX_DMA_CH, UART7_TX_DMA_SUBPERIx);
# endif
#endif
}

extern "C" {
void TIMER1_IRQHandler() {
	const auto nIntFlag = TIMER_INTF(TIMER1);
	const auto nUartsSending = sv_nUartsSending;
	logic_analyzer::ch0_set();

	if ((nIntFlag & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) {		// Start break
#if defined (DMX_USE_USART0)
		if (nUartsSending & (1U << config::USART0_PORT)) {
			sv_nUartsSending |= (1U << (config::USART0_PORT + 8));
			_gpio_mode_output(USART0_GPIO_PORT, USART0_TX_PIN);
			GPIO_BC(USART0_GPIO_PORT) = USART0_TX_PIN;
		}
#endif
#if defined (DMX_USE_USART1)
		if (nUartsSending & (1U << config::USART1_PORT)) {
			sv_nUartsSending |= (1U << (config::USART1_PORT + 8));
			_gpio_mode_output(USART1_GPIO_PORT, USART1_TX_PIN);
			GPIO_BC(USART1_GPIO_PORT) = USART1_TX_PIN;
		}
#endif
#if defined (DMX_USE_USART2)
		if (nUartsSending & (1U << config::USART2_PORT)) {
			sv_nUartsSending |= (1U << (config::USART2_PORT + 8));
			_gpio_mode_output(USART2_GPIO_PORT, USART2_TX_PIN);
			GPIO_BC(USART2_GPIO_PORT) = USART2_TX_PIN;
		}
#endif
#if defined (DMX_USE_UART3)
		if (nUartsSending & (1U << config::UART3_PORT)) {
			sv_nUartsSending |= (1U << (config::UART3_PORT + 8));
			_gpio_mode_output(UART3_GPIO_PORT, UART3_TX_PIN);
			GPIO_BC(UART3_GPIO_PORT) = UART3_TX_PIN;
		}
#endif
#if defined (DMX_USE_UART4)
		if (nUartsSending & (1U << config::UART4_PORT)) {
			sv_nUartsSending |= (1U << (config::UART4_PORT + 8));
			_gpio_mode_output(UART4_GPIO_TX_PORT, UART4_TX_PIN);
			GPIO_BC(UART4_GPIO_TX_PORT) = UART4_TX_PIN;
		}
#endif
#if defined (DMX_USE_USART5)
		if (nUartsSending & (1U << config::USART5_PORT)) {
			sv_nUartsSending |= (1U << (config::USART5_PORT + 8));
			_gpio_mode_output(USART5_GPIO_PORT, USART5_TX_PIN);
			GPIO_BC(USART5_GPIO_PORT) = USART5_TX_PIN;
		}
#endif
#if defined (DMX_USE_UART6)
		if (nUartsSending & (1U << config::UART6_PORT)) {
			sv_nUartsSending |= (1U << (config::UART6_PORT + 8));
			_gpio_mode_output(UART6_GPIO_PORT, UART6_TX_PIN);
			GPIO_BC(UART6_GPIO_PORT) = UART6_TX_PIN;
		}
#endif
#if defined (DMX_USE_UART7)
		if (nUartsSending & (1U << config::UART7_PORT)) {
			sv_nUartsSending |= (1U << (config::UART7_PORT + 8));
			_gpio_mode_output(UART7_GPIO_PORT, UART7_TX_PIN);
			GPIO_BC(UART7_GPIO_PORT) = UART7_TX_PIN;
		}
#endif
	} else if ((nIntFlag & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1) {	// Stop break
#if defined (DMX_USE_USART0)
		if (nUartsSending & (1U << (config::USART0_PORT + 8))) {
			_gpio_mode_af(USART0_GPIO_PORT, USART0_TX_PIN, USART0);
		}
#endif
#if defined (DMX_USE_USART1)
		if (nUartsSending & (1U << (config::USART1_PORT + 8))) {
			_gpio_mode_af(USART1_GPIO_PORT, USART1_TX_PIN, USART1);
		}
#endif
#if defined (DMX_USE_USART2)
		if (nUartsSending & (1U << (config::USART2_PORT + 8))) {
			_gpio_mode_af(USART2_GPIO_PORT, USART2_TX_PIN, USART2);
		}
#endif
#if defined (DMX_USE_UART3)
		if (nUartsSending & (1U << (config::UART3_PORT + 8))) {
			_gpio_mode_af(UART3_GPIO_PORT, UART3_TX_PIN, UART3);
		}
#endif
#if defined (DMX_USE_UART4)
		if (nUartsSending & (1U << (config::UART4_PORT + 8))) {
			_gpio_mode_af(UART4_GPIO_TX_PORT, UART4_TX_PIN, UART4);
		}
#endif
#if defined (DMX_USE_USART5)
		if (nUartsSending & (1U << (config::USART5_PORT + 8))) {
			_gpio_mode_af(USART5_GPIO_PORT, USART5_TX_PIN, USART5);
		}
#endif
#if defined (DMX_USE_UART6)
		if (nUartsSending & (1U << (config::UART6_PORT + 8))) {
			_gpio_mode_af(UART6_GPIO_PORT, UART6_TX_PIN, UART6);
		}
#endif
#if defined (DMX_USE_UART7)
		if (nUartsSending & (1U << (config::UART7_PORT + 8))) {
			_gpio_mode_af(UART7_GPIO_PORT, UART7_TX_PIN, UART7);
		}
#endif
	} else if ((nIntFlag & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2) {	// Send data
#if defined (DMX_USE_USART0)
		if (nUartsSending & (1U << (config::USART0_PORT + 8))) {
			DMA_CHCTL(USART0_DMA, USART0_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			dma_interrupt_flag_clear(USART0_DMA, USART0_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(USART0_DMA, USART0_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::USART0_PORT].data;
			DMA_CHCNT(USART0_DMA, USART0_TX_DMA_CH) = (s_TxBuffer[config::USART0_PORT].nLength & DMA_CHXCNT_CNT);
			DMA_CHCTL(USART0_DMA, USART0_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(USART0, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_USART1)
		if (nUartsSending & (1U << (config::USART1_PORT + 8))) {
			DMA_CHCTL(USART1_DMA, USART1_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			dma_interrupt_flag_clear(USART1_DMA, USART1_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(USART1_DMA, USART1_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::USART1_PORT].data;
			DMA_CHCNT(USART1_DMA, USART1_TX_DMA_CH) = (s_TxBuffer[config::USART1_PORT].nLength & DMA_CHXCNT_CNT);
			DMA_CHCTL(USART1_DMA, USART1_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(USART1, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_USART2)
		if (nUartsSending & (1U << (config::USART2_PORT + 8))) {
			DMA_CHCTL(USART2_DMA, USART2_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			dma_interrupt_flag_clear(USART2_DMA, USART2_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(USART2_DMA, USART2_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::USART2_PORT].data;
			DMA_CHCNT(USART2_DMA, USART2_TX_DMA_CH) = (s_TxBuffer[config::USART2_PORT].nLength & DMA_CHXCNT_CNT);
			DMA_CHCTL(USART2_DMA, USART2_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(USART2, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_UART3)
		if (nUartsSending & (1U << (config::UART3_PORT + 8))) {
			dma_channel_disable(UART3_DMA, UART3_TX_DMA_CH);
			dma_interrupt_flag_clear(UART3_DMA, UART3_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(UART3_DMA, UART3_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::UART3_PORT].data;
			DMA_CHCNT(UART3_DMA, UART3_TX_DMA_CH) = (s_TxBuffer[config::UART3_PORT].nLength & DMA_CHXCNT_CNT);
			DMA_CHCTL(UART3_DMA, UART3_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(UART3, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_UART4)
		if (nUartsSending & (1U << (config::UART4_PORT + 8))) {
			DMA_CHCTL(UART4_DMA, UART4_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			dma_interrupt_flag_clear(UART4_DMA, UART4_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(UART4_DMA, UART4_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::UART4_PORT].data;
			DMA_CHCNT(UART4_DMA, UART4_TX_DMA_CH) = (s_TxBuffer[config::UART4_PORT].nLength & DMA_CHXCNT_CNT);
			DMA_CHCTL(UART4_DMA, UART4_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(UART4, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_USART5)
		if (nUartsSending & (1U << (config::USART5_PORT + 8))) {
			DMA_CHCTL(USART5_DMA, USART5_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			dma_interrupt_flag_clear(USART5_DMA, USART5_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(USART5_DMA, USART5_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::USART5_PORT].data;
			DMA_CHCNT(USART5_DMA, USART5_TX_DMA_CH) = (s_TxBuffer[config::USART5_PORT].nLength & DMA_CHXCNT_CNT);
			DMA_CHCTL(USART5_DMA, USART5_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(USART5, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_UART6)
		if (nUartsSending & (1U << (config::UART6_PORT + 8))) {
			DMA_CHCTL(UART6_DMA, UART6_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			dma_interrupt_flag_clear(UART6_DMA, UART6_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(UART6_DMA, UART6_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::UART6_PORT].data;
			DMA_CHCNT(UART6_DMA, UART6_TX_DMA_CH) = (s_TxBuffer[config::UART6_PORT].nLength & DMA_CHXCNT_CNT);
			DMA_CHCTL(UART6_DMA, UART6_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(UART6, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_UART7)
		if (nUartsSending & (1U << (config::UART7_PORT + 8))) {
			DMA_CHCTL(UART7_DMA, UART7_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			dma_interrupt_flag_clear(UART7_DMA, UART7_TX_DMA_CH, DMA_INTF_FTFIF);
			DMA_CHMADDR(UART7_DMA, UART7_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::UART6_PORT].data;
			DMA_CHCNT(UART7_DMA, UART7_TX_DMA_CH) = (s_TxBuffer[config::UART7_PORT].nLength & DMA_CHXCNT_CNT);
			DMA_CHCTL(UART7_DMA, UART7_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(UART7, USART_DENT_ENABLE);
		}
#endif
	} else {
		// 0x00000013
	}

	timer_interrupt_flag_clear(TIMER1, nIntFlag);

	logic_analyzer::ch0_clear();
}

#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
void TIMER2_IRQHandler() {
	const auto nIntFlag = TIMER_INTF(TIMER2);

	if ((nIntFlag & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) {
		if (s_RxBuffer[0].State == TxRxState::DMXDATA) {
			s_RxBuffer[0].State = TxRxState::IDLE;
			s_RxBuffer[0].Dmx.nSlotsInPacket |= 0x8000;
			logic_analyzer::ch1_clear();
		} else if (s_RxBuffer[0].State == TxRxState::RDMDISC) {
			s_RxBuffer[0].State = TxRxState::IDLE;
			s_RxBuffer[0].Dmx.nSlotsInPacket |= 0x4000;
			logic_analyzer::ch1_clear();
			logic_analyzer::ch2_clear();
		}
	}
#if DMX_MAX_PORTS >= 2
	else if ((nIntFlag & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1) {
		if (s_RxBuffer[1].State == TxRxState::DMXDATA) {
			s_RxBuffer[1].State = TxRxState::IDLE;
			s_RxBuffer[1].Dmx.nSlotsInPacket |= 0x8000;
			logic_analyzer::ch1_clear();
		} else if (s_RxBuffer[1].State == TxRxState::RDMDISC) {
			s_RxBuffer[1].State = TxRxState::IDLE;
			s_RxBuffer[1].Dmx.nSlotsInPacket |= 0x4000;
			logic_analyzer::ch1_clear();
			logic_analyzer::ch2_clear();
		}
	}
#endif
#if DMX_MAX_PORTS >= 3
	else if ((nIntFlag & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2) {
		if (s_RxBuffer[2].State == TxRxState::DMXDATA) {
			s_RxBuffer[2].State = TxRxState::IDLE;
			s_RxBuffer[2].Dmx.nSlotsInPacket |= 0x8000;
			logic_analyzer::ch1_clear();
		} else if (s_RxBuffer[2].State == TxRxState::RDMDISC) {
			s_RxBuffer[2].State = TxRxState::IDLE;
			s_RxBuffer[2].Dmx.nSlotsInPacket |= 0x4000;
			logic_analyzer::ch1_clear();
			logic_analyzer::ch2_clear();
		}
	}
#endif
#if DMX_MAX_PORTS >= 4
	else if ((nIntFlag & TIMER_INT_FLAG_CH3) == TIMER_INT_FLAG_CH3) {
		if (s_RxBuffer[3].State == TxRxState::DMXDATA) {
			s_RxBuffer[3].State = TxRxState::IDLE;
			s_RxBuffer[3].Dmx.nSlotsInPacket |= 0x8000;
			logic_analyzer::ch1_clear();
		} else if (s_RxBuffer[3].State == TxRxState::RDMDISC) {
			s_RxBuffer[3].State = TxRxState::IDLE;
			s_RxBuffer[3].Dmx.nSlotsInPacket |= 0x4000;
			logic_analyzer::ch1_clear();
			logic_analyzer::ch2_clear();
		}
	}
#endif
	timer_interrupt_flag_clear(TIMER2, nIntFlag);
}

void TIMER3_IRQHandler() {
	const auto nIntFlag = TIMER_INTF(TIMER3);
#if DMX_MAX_PORTS >= 5
	if ((nIntFlag & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) {
		if (s_RxBuffer[4].State == TxRxState::DMXDATA) {
			s_RxBuffer[4].State = TxRxState::IDLE;
			s_RxBuffer[4].Dmx.nSlotsInPacket |= 0x8000;
			logic_analyzer::ch1_clear();
		} else if (s_RxBuffer[4].State == TxRxState::RDMDISC) {
			s_RxBuffer[4].State = TxRxState::IDLE;
			s_RxBuffer[4].Dmx.nSlotsInPacket |= 0x4000;
			logic_analyzer::ch1_clear();
			logic_analyzer::ch2_clear();
		}
	}
# if DMX_MAX_PORTS >= 6
	else if ((nIntFlag & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1) {
		if (s_RxBuffer[5].State == TxRxState::DMXDATA) {
			s_RxBuffer[5].State = TxRxState::IDLE;
			s_RxBuffer[5].Dmx.nSlotsInPacket |= 0x8000;
			logic_analyzer::ch1_clear();
		} else if (s_RxBuffer[5].State == TxRxState::RDMDISC) {
			s_RxBuffer[5].State = TxRxState::IDLE;
			s_RxBuffer[5].Dmx.nSlotsInPacket |= 0x4000;
			logic_analyzer::ch1_clear();
			logic_analyzer::ch2_clear();
		}
	}
# endif
# if DMX_MAX_PORTS >= 7
	else if ((nIntFlag & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2) {
		if (s_RxBuffer[6].State == TxRxState::DMXDATA) {
			s_RxBuffer[6].State = TxRxState::IDLE;
			s_RxBuffer[6].Dmx.nSlotsInPacket |= 0x8000;
			logic_analyzer::ch1_clear();
		} else if (s_RxBuffer[6].State == TxRxState::RDMDISC) {
			s_RxBuffer[6].State = TxRxState::IDLE;
			s_RxBuffer[6].Dmx.nSlotsInPacket |= 0x4000;
			logic_analyzer::ch1_clear();
			logic_analyzer::ch2_clear();
		}
	}
# endif
# if DMX_MAX_PORTS == 8
	else if ((nIntFlag & TIMER_INT_FLAG_CH3) == TIMER_INT_FLAG_CH3) {
		if (s_RxBuffer[7].State == TxRxState::DMXDATA) {
			s_RxBuffer[7].State = TxRxState::IDLE;
			s_RxBuffer[7].Dmx.nSlotsInPacket |= 0x8000;
			logic_analyzer::ch1_clear();
		} else if (s_RxBuffer[7].State == TxRxState::RDMDISC) {
			s_RxBuffer[7].State = TxRxState::IDLE;
			s_RxBuffer[7].Dmx.nSlotsInPacket |= 0x4000;
			logic_analyzer::ch1_clear();
			logic_analyzer::ch2_clear();
		}
	}
# endif
#endif
	timer_interrupt_flag_clear(TIMER3, nIntFlag);
}

void TIMER6_IRQHandler() {
	for (auto i = 0; i < DMX_MAX_PORTS; i++) {
		sv_nRxDmxPackets[i].nPerSecond = sv_nRxDmxPackets[i].nCount - sv_nRxDmxPackets[i].nCountPrevious;
		sv_nRxDmxPackets[i].nCountPrevious = sv_nRxDmxPackets[i].nCount;
	}

	timer_interrupt_flag_clear(TIMER6, TIMER_INT_FLAG_UP);
}
#endif
}

static void uart_dmx_config(uint32_t usart_periph) {
	gd32_uart_begin(usart_periph, 250000U, GD32_UART_BITS_8, GD32_UART_PARITY_NONE, GD32_UART_STOP_2BITS);
}

