vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
Dmx *Dmx::s_pThis = nullptr;

Dmx::Dmx() {
	DEBUG_ENTRY

	assert(s_pThis == nullptr);
	s_pThis = this;

	sv_nUartsSending = 0;

	for (auto i = 0; i < DMX_MAX_PORTS; i++) {
#if !defined (GD32F4XX)
		gpio_init(s_DirGpio[i].nPort, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, s_DirGpio[i].nPin);
#else
		gpio_mode_set(s_DirGpio[i].nPort, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLDOWN, s_DirGpio[i].nPin);
		gpio_output_options_set(s_DirGpio[i].nPort, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, s_DirGpio[i].nPin);
		gpio_af_set(s_DirGpio[i].nPort, GPIO_AF_0, s_DirGpio[i].nPin);
#endif
		ClearData(i);
		sv_PortState[i] = PortState::IDLE;
		SetPortDirection(i, PortDirection::INP, false);
		s_RxBuffer[i].State = TxRxState::IDLE;
	}

	usart_dma_config();	// DMX Transmit
	timer2_config();	// DMX Receive	-> Slot time-out Port 0,1,2,3
	timer3_config();	// DMX Receive	-> Slot time-out Port 4,5,6,7
	timer6_config();	// DMX Receive	-> Updates per second

#if defined (DMX_USE_USART0)
	uart_dmx_config(USART0);
	NVIC_EnableIRQ(USART0_IRQn);
#endif
#if defined (DMX_USE_USART1)
	uart_dmx_config(USART1);
	NVIC_EnableIRQ(USART1_IRQn);
#endif
#if defined (DMX_USE_USART2)
	uart_dmx_config(USART2);
	NVIC_EnableIRQ(USART2_IRQn);
#endif
#if defined (DMX_USE_UART3)
	uart_dmx_config(UART3);
	NVIC_EnableIRQ(UART3_IRQn);
#endif
#if defined (DMX_USE_UART4)
	uart_dmx_config(UART4);
	NVIC_EnableIRQ(UART4_IRQn);
#endif
#if defined (DMX_USE_USART5)
	uart_dmx_config(USART5);
	NVIC_EnableIRQ(USART5_IRQn);
#endif
#if defined (DMX_USE_UART6)
	uart_dmx_config(UART6);
	NVIC_EnableIRQ(UART6_IRQn);
#endif
#if defined (DMX_USE_UART7)
	uart_dmx_config(UART7);
	NVIC_EnableIRQ(UART7_IRQn);
#endif

	logic_analyzer::init();
	DEBUG_EXIT
}

void Dmx::SetPortDirection(uint32_t nPortIndex, PortDirection tPortDirection, bool bEnableData) {
	DEBUG_PRINTF("%u:%c:%d", nPortIndex, tPortDirection == PortDirection::INP ? 'I' : 'O', bEnableData);
	assert(nPortIndex < DMX_MAX_PORTS);

	const auto nUart = _port_to_uart(nPortIndex);

	if (m_tDmxPortDirection[nPortIndex] != tPortDirection) {
		m_tDmxPortDirection[nPortIndex] = tPortDirection;

		StopData(nUart, nPortIndex);

		if (tPortDirection == PortDirection::OUTP) {
			GPIO_BOP(s_DirGpio[nPortIndex].nPort) = s_DirGpio[nPortIndex].nPin;
		} else if (tPortDirection == PortDirection::INP) {
			GPIO_BC(s_DirGpio[nPortIndex].nPort) = s_DirGpio[nPortIndex].nPin;
		} else {
			assert(0);
		}
	} else if (!bEnableData) {
		StopData(nUart, nPortIndex);
	}

	if (bEnableData) {
		StartData(nUart, nPortIndex);
	}
}

void Dmx::ClearData(uint32_t nPortIndex) {
	assert(nPortIndex < DMX_MAX_PORTS);
	auto *p = &s_TxBuffer[nPortIndex];
	auto *p16 = reinterpret_cast<uint16_t *>(p->data);

	for (auto i = 0; i < dmx::buffer::SIZE / 2; i++) {
		*p16++ = 0;
	}

	p->nLength = 513; // Including START Code
}

void Dmx::StartData(uint32_t nUart, uint32_t nPortIndex) {
	DEBUG_PRINTF("%u", nPortIndex);
	assert(nPortIndex < DMX_MAX_PORTS);
	assert(sv_PortState[nPortIndex] == PortState::IDLE);

	if (m_tDmxPortDirection[nPortIndex] == PortDirection::OUTP) {
		if (sv_nUartsSending == 0) {
			timer1_config();
		}
		sv_nUartsSending |= (1U << nPortIndex);
		sv_PortState[nPortIndex] = PortState::TX;
	} else if (m_tDmxPortDirection[nPortIndex] == PortDirection::INP) {
		s_RxBuffer[nPortIndex].State = TxRxState::IDLE;

		while (RESET == usart_flag_get(nUart, USART_FLAG_TBE))
			;

		usart_interrupt_flag_clear(nUart, USART_INT_FLAG_RBNE);
		usart_interrupt_enable(nUart, USART_INT_RBNE);

		sv_PortState[nPortIndex] = PortState::RX;

#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
		switch (nPortIndex) {
		case 0:
			TIMER_DMAINTEN(TIMER2) |= (uint32_t) TIMER_INT_CH0;
			break;
#if DMX_MAX_PORTS >= 2
		case 1:
			TIMER_DMAINTEN(TIMER2) |= (uint32_t) TIMER_INT_CH1;
			break;
#endif
#if DMX_MAX_PORTS >= 3
		case 2:
			TIMER_DMAINTEN(TIMER2) |= (uint32_t) TIMER_INT_CH2;
			break;
#endif
#if DMX_MAX_PORTS >= 4
		case 3:
			TIMER_DMAINTEN(TIMER2) |= (uint32_t) TIMER_INT_CH3;
			break;
#endif
#if DMX_MAX_PORTS >= 5
		case 4:
			TIMER_DMAINTEN(TIMER3) |= (uint32_t) TIMER_INT_CH0;
			break;
#endif
#if DMX_MAX_PORTS >= 6
		case 5:
			TIMER_DMAINTEN(TIMER3) |= (uint32_t) TIMER_INT_CH1;
			break;
#endif
#if DMX_MAX_PORTS >= 7
		case 6:
			TIMER_DMAINTEN(TIMER3) |= (uint32_t) TIMER_INT_CH2;
			break;
#endif
#if DMX_MAX_PORTS == 8
		case 7:
			TIMER_DMAINTEN(TIMER3) |= (uint32_t) TIMER_INT_CH3;
			break;
#endif
		default:
			assert(0);
			__builtin_unreachable();
			break;
		}
#endif
	} else {
		assert(0);
		__builtin_unreachable();
	}

	DEBUG_EXIT
}

void Dmx::StopData(uint32_t nUart, uint32_t nPortIndex) {
	DEBUG_PRINTF("%u", nPortIndex);
	assert(nPortIndex < DMX_MAX_PORTS);

	if (sv_PortState[nPortIndex] == PortState::IDLE) {
		DEBUG_EXIT
		return;
	}

	if (m_tDmxPortDirection[nPortIndex] == PortDirection::OUTP) {
		sv_nUartsSending &= ~ (1U << nPortIndex);


		__DMB();
		if ((sv_nUartsSending & (1U << (nPortIndex + 8))) == (1U << (nPortIndex + 8))) {
			while (SET != usart_flag_get(nUart, USART_FLAG_TBE));
		}

		sv_nUartsSending &= ~ (1U << (nPortIndex + 8));
		__DSB();

	} else if (m_tDmxPortDirection[nPortIndex] == PortDirection::INP) {
		usart_interrupt_disable(nUart, USART_INT_RBNE);
		s_RxBuffer[nPortIndex].State = TxRxState::IDLE;

#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
		switch (nPortIndex) {
		case 0:
			TIMER_DMAINTEN(TIMER2) &= (~(uint32_t) TIMER_INT_CH0);
			break;
#if DMX_MAX_PORTS >= 2
		case 1:
			TIMER_DMAINTEN(TIMER2) &= (~(uint32_t) TIMER_INT_CH1);
			break;
#endif
#if DMX_MAX_PORTS >= 3
		case 2:
			TIMER_DMAINTEN(TIMER2) &= (~(uint32_t) TIMER_INT_CH2);
			break;
#endif
#if DMX_MAX_PORTS >= 4
		case 3:
			TIMER_DMAINTEN(TIMER2) &= (~(uint32_t) TIMER_INT_CH3);
			break;
#endif
#if DMX_MAX_PORTS >= 5
		case 4:
			TIMER_DMAINTEN(TIMER3) &= (~(uint32_t) TIMER_INT_CH0);
			break;
#endif
#if DMX_MAX_PORTS >= 6
		case 5:
			TIMER_DMAINTEN(TIMER3) &= (~(uint32_t) TIMER_INT_CH1);
			break;
#endif
#if DMX_MAX_PORTS >= 7
		case 6:
			TIMER_DMAINTEN(TIMER3) &= (~(uint32_t) TIMER_INT_CH2);
			break;
#endif
#if DMX_MAX_PORTS == 8
		case 7:
			TIMER_DMAINTEN(TIMER3) &= (~(uint32_t) TIMER_INT_CH3);
			break;
#endif
		default:
			assert(0);
			__builtin_unreachable();
			break;
		}
#endif
	} else {
		assert(0);
		__builtin_unreachable();
	}

	sv_PortState[nPortIndex] = PortState::IDLE;

