vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
	DEBUG_EXIT
}

// DMX Send

void Dmx::SetDmxBreakTime(uint32_t nBreakTime) {
	s_nDmxTransmitBreakTime = std::max(transmit::BREAK_TIME_MIN, nBreakTime);

	SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
}

void Dmx::SetDmxMabTime(uint32_t nMabTime) {
	s_nDmxTransmitMabTime = std::max(transmit::MAB_TIME_MIN, nMabTime);

	SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
}

void Dmx::SetDmxPeriodTime(uint32_t nPeriod) {
	m_nDmxTransmitPeriodRequested = nPeriod;

	auto nLengthMax = s_TxBuffer[0].nLength;

	for (auto i = 1; i < config::max::OUT; i++) {
		if (s_TxBuffer[i].nLength > nLengthMax) {
			nLengthMax = s_TxBuffer[i].nLength;
		}
	}

	auto nPackageLengthMicroSeconds = s_nDmxTransmitBreakTime + s_nDmxTransmitMabTime + (nLengthMax * 44U);

	// The GD32F4xx Timer 1 has a 32-bit counter
#if ! defined(GD32F4XX)
	if (nPackageLengthMicroSeconds > (static_cast<uint16_t>(~0) - 44U)) {
		s_nDmxTransmitBreakTime = std::min(transmit::BREAK_TIME_TYPICAL, s_nDmxTransmitBreakTime);
		s_nDmxTransmitMabTime = transmit::MAB_TIME_MIN;
		nPackageLengthMicroSeconds = s_nDmxTransmitBreakTime + s_nDmxTransmitMabTime + (nLengthMax * 44U);
	}
#endif

	if (nPeriod != 0) {
		if (nPeriod < nPackageLengthMicroSeconds) {
			s_nDmxTransmitPeriod = std::max(transmit::BREAK_TO_BREAK_TIME_MIN, nPackageLengthMicroSeconds + 44U);
		} else {
			s_nDmxTransmitPeriod = nPeriod;
		}
	} else {
		s_nDmxTransmitPeriod = std::max(transmit::BREAK_TO_BREAK_TIME_MIN, nPackageLengthMicroSeconds + 44U);
	}

	DEBUG_PRINTF("nPeriod=%u, nLengthMax=%u, s_nDmxTransmitPeriod=%u", nPeriod, nLengthMax, s_nDmxTransmitPeriod);
}

void Dmx::SetDmxSlots(uint16_t nSlots) {
	if ((nSlots >= 2) && (nSlots <= dmx::max::CHANNELS)) {
		m_nDmxTransmitSlots = nSlots;

		for (auto i = 0; i < config::max::OUT; i++) {
			if (m_nDmxTransmissionLength[i] != 0) {
				m_nDmxTransmissionLength[i] = std::min(m_nDmxTransmissionLength[i], static_cast<uint32_t>(nSlots));
			}
		}

		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}
}

void Dmx::SetSendData(uint32_t nPortIndex, const uint8_t *pData, uint32_t nLength) {
	assert(nPortIndex < DMX_MAX_PORTS);

	auto *p = &s_TxBuffer[nPortIndex];
	auto *pDst = p->data;

	nLength = std::min(nLength, static_cast<uint32_t>(m_nDmxTransmitSlots));
	p->nLength = nLength + 1U;

	__builtin_prefetch(pData);
	memcpy(pDst, pData,  nLength);

	if (nLength != m_nDmxTransmissionLength[nPortIndex]) {
		m_nDmxTransmissionLength[nPortIndex] = nLength;
		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}
}

void Dmx::SetPortSendDataWithoutSC(uint32_t nPortIndex, const uint8_t *pData, uint32_t nLength) {
	assert(nPortIndex < DMX_MAX_PORTS);

	auto *p = &s_TxBuffer[nPortIndex];
	auto *pDst = p->data;

	nLength = std::min(nLength, static_cast<uint32_t>(m_nDmxTransmitSlots));
	p->nLength = nLength + 1U;

	__builtin_prefetch(pData);
	memcpy(&pDst[1], pData,  nLength);

	if (nLength != m_nDmxTransmissionLength[nPortIndex]) {
		m_nDmxTransmissionLength[nPortIndex] = nLength;
		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}
}

void Dmx::Blackout() {
	DEBUG_ENTRY

	if (sv_nUartsSending == 0) {
		return;
	}

	for (uint32_t nPortIndex = 0; nPortIndex < DMX_MAX_PORTS; nPortIndex++) {
		const auto nUart = _port_to_uart(nPortIndex);
		__DMB();
		if ((sv_nUartsSending & (1U << (nPortIndex + 8))) == (1U << (nPortIndex + 8))) {
			while (SET != usart_flag_get(nUart, USART_FLAG_TBE));

			auto *p = &s_TxBuffer[nPortIndex];
			auto *p16 = reinterpret_cast<uint16_t *>(p->data);

			for (auto i = 0; i < dmx::buffer::SIZE / 2; i++) {
				*p16++ = 0;
			}

			p->data[0] = dmx::START_CODE;
		}
	}

	DEBUG_EXIT
}

void Dmx::FullOn() {
	DEBUG_ENTRY

	if (sv_nUartsSending == 0) {
		return;
	}

	for (uint32_t nPortIndex = 0; nPortIndex < DMX_MAX_PORTS; nPortIndex++) {
		const auto nUart = _port_to_uart(nPortIndex);
		__DMB();
		if ((sv_nUartsSending & (1U << (nPortIndex + 8))) == (1U << (nPortIndex + 8))) {
			while (SET != usart_flag_get(nUart, USART_FLAG_TBE));

			auto *p = &s_TxBuffer[nPortIndex];
			auto *p16 = reinterpret_cast<uint16_t *>(p->data);

			for (auto i = 0; i < dmx::buffer::SIZE / 2; i++) {
				*p16++ = static_cast<uint16_t>(~0);
			}

			p->data[0] = dmx::START_CODE;
		}
	}

	DEBUG_EXIT
}

// DMX Receive

const uint8_t* Dmx::GetDmxChanged(uint32_t nPortIndex) {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	const auto *p = GetDmxAvailable(nPortIndex);

	if (p == nullptr) {
		return nullptr;
	}

	const auto *pSrc16 = reinterpret_cast<const uint16_t*>(p);
	auto *pDst16 = reinterpret_cast<uint16_t *>(&s_RxDmxPrevious[nPortIndex][0]);

	auto isChanged = false;

	for (auto i = 0; i < buffer::SIZE / 2; i++) {
		if (*pDst16 != *pSrc16) {
			*pDst16 = *pSrc16;
			isChanged = true;
		}
		pDst16++;
		pSrc16++;
	}

	return (isChanged ? p : nullptr);
#else
	return nullptr;
#endif
}

const uint8_t *Dmx::GetDmxAvailable(uint32_t nPortIndex)  {
	assert(nPortIndex < DMX_MAX_PORTS);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	if ((s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket & 0x8000) != 0x8000) {
		return nullptr;
	}

	s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket &= ~0x8000;
	s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket--;	// Remove SC from length

	return s_RxBuffer[nPortIndex].data;
#else
	return nullptr;
#endif
}

const uint8_t* Dmx::GetDmxCurrentData(uint32_t nPortIndex) {
	return s_RxBuffer[nPortIndex].data;
}

uint32_t Dmx::GetUpdatesPerSecond(uint32_t nPortIndex) {
	assert(nPortIndex < DMX_MAX_PORTS);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	__DMB();
	return sv_nRxDmxPackets[nPortIndex].nPerSecond;
#else
	return 0;
#endif
}

uint32_t GetDmxReceivedCount(uint32_t nPortIndex) {
	assert(nPortIndex < DMX_MAX_PORTS);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	__DMB();
	return sv_nRxDmxPackets[nPortIndex].nCount;
#else
	return 0;
#endif
}

// RDM Send

void Dmx::RdmSendRaw(uint32_t nPortIndex, const uint8_t* pRdmData, uint32_t nLength) {
	DEBUG_PRINTF("%u", nPortIndex);
	assert(nPortIndex < DMX_MAX_PORTS);
	assert(pRdmData != nullptr);
	assert(nLength != 0);

	const auto nUart = _port_to_uart(nPortIndex);

	while (RESET == usart_flag_get(nUart, USART_FLAG_TC))
		;

	switch (nUart) {
#if defined (DMX_USE_USART0)
	case USART0:
		_gpio_mode_output(USART0_GPIO_PORT, USART0_TX_PIN);
		GPIO_BC(USART0_GPIO_PORT) = USART0_TX_PIN;
		break;
#endif
#if defined (DMX_USE_USART1)
	case USART1:
		_gpio_mode_output(USART1_GPIO_PORT, USART1_TX_PIN);
		GPIO_BC(USART1_GPIO_PORT) = USART1_TX_PIN;
		break;
#endif
#if defined (DMX_USE_USART2)
	case USART2:
		_gpio_mode_output(USART2_GPIO_PORT, USART2_TX_PIN);
		GPIO_BC(USART2_GPIO_PORT) = USART2_TX_PIN;
		break;
#endif
#if defined (DMX_USE_UART3)
	case UART3:
		_gpio_mode_output(UART3_GPIO_PORT, UART3_TX_PIN);
		GPIO_BC(UART3_GPIO_PORT) = UART3_TX_PIN;
		break;
#endif
#if defined (DMX_USE_UART4)
	case UART4:
		_gpio_mode_output(UART4_GPIO_TX_PORT, UART4_TX_PIN);
		GPIO_BC(UART4_GPIO_TX_PORT) = UART4_TX_PIN;
		break;
#endif
#if defined (DMX_USE_USART5)
	case USART5:
		_gpio_mode_output(USART5_GPIO_PORT, USART5_TX_PIN);
		GPIO_BC(USART5_GPIO_PORT) = USART5_TX_PIN;
		break;
#endif
#if defined (DMX_USE_UART6)
	case UART6:
		_gpio_mode_output(UART6_GPIO_PORT, UART6_TX_PIN);
		GPIO_BC(UART6_GPIO_PORT) = UART6_TX_PIN;
		break;
#endif
#if defined (DMX_USE_UART7)
	case UART7:
		_gpio_mode_output(UART7_GPIO_PORT, UART7_TX_PIN);
		GPIO_BC(UART7_GPIO_PORT) = UART7_TX_PIN;
		break;
#endif
	default:
		assert(0);
		__builtin_unreachable();
		break;
	}

	udelay(RDM_TRANSMIT_BREAK_TIME);

	switch (nUart) {
#if defined (DMX_USE_USART0)
	case USART0:
		_gpio_mode_af(USART0_GPIO_PORT, USART0_TX_PIN, USART0);
		break;
#endif
#if defined (DMX_USE_USART1)
	case USART1:
		_gpio_mode_af(USART1_GPIO_PORT, USART1_TX_PIN, USART1);
		break;
#endif
#if defined (DMX_USE_USART2)
	case USART2:
		_gpio_mode_af(USART2_GPIO_PORT, USART2_TX_PIN, USART2);
		break;
#endif
#if defined (DMX_USE_UART3)
	case UART3:
		_gpio_mode_af(UART3_GPIO_PORT, UART3_TX_PIN, UART3);
		break;
#endif
#if defined (DMX_USE_UART4)
	case UART4:
		_gpio_mode_af(UART4_GPIO_TX_PORT, UART4_TX_PIN, UART4);
		break;
#endif
#if defined (DMX_USE_USART5)
	case USART5:
		_gpio_mode_af(USART5_GPIO_PORT, USART5_TX_PIN, USART5);
		break;
#endif
#if defined (DMX_USE_UART6)
	case UART6:
		_gpio_mode_af(UART6_GPIO_PORT, UART6_TX_PIN, UART6);
		break;
#endif
#if defined (DMX_USE_UART7)
	case UART7:
		_gpio_mode_af(UART7_GPIO_PORT, UART7_TX_PIN, UART7);
		break;
#endif
	default:
		assert(0);
		__builtin_unreachable();
		break;
	}

	udelay(RDM_TRANSMIT_MAB_TIME);

	for (auto i = 0; i < nLength; i++) {
		while (RESET == usart_flag_get(nUart, USART_FLAG_TBE))
			;
		USART_DATA(nUart) = static_cast<uint16_t>(USART_DATA_DATA & pRdmData[i]);
	}

	while (SET != usart_flag_get(nUart, USART_FLAG_TC)) {
		static_cast<void>(GET_BITS(USART_DATA(nUart), 0U, 8U));
	}
}

// RDM Receive

const uint8_t *Dmx::RdmReceive(uint32_t nPortIndex) {
	assert(nPortIndex < DMX_MAX_PORTS);

	if ((s_RxBuffer[nPortIndex].Rdm.nIndex & 0x4000) != 0x4000) {
		return nullptr;
	}

	s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket = 0; // This is correct.
	return s_RxBuffer[nPortIndex].data;
}

const uint8_t *Dmx::RdmReceiveTimeOut(uint32_t nPortIndex, uint16_t nTimeOut) {
	assert(nPortIndex < DMX_MAX_PORTS);

	uint8_t *p = nullptr;
	TIMER_CNT(TIMER5) = 0;

	do {
		if ((p = const_cast<uint8_t*>(RdmReceive(nPortIndex))) != nullptr) {
			return p;
		}
	} while (TIMER_CNT(TIMER5) < nTimeOut);

	return nullptr;
}
